матрица = [
    [0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0],  # вершина 1
    [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],  # вершина 2
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0],  # вершина 3
    [1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0],  # вершина 4
    [0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0],  # вершина 5
    [0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0],  # вершина 6
    [0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0],  # вершина 7
    [0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],  # вершина 8
    [0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0],  # вершина 9
    [0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1],  # вершина 10
    [0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0]   # вершина 11
]

стартовая_вершина = 9

посещённые = [стартовая_вершина]
текущая_волна = [стартовая_вершина]

#{вершина: уровень}
уровни = {}

#расстояние от старта
номер_волны = 1

while текущая_волна:
    следующая_волна = []
    
    for вершина in текущая_волна:
        #строка вершины в матрице про её соседей
        строка_связей = матрица[вершина - 1]
        
        # Перебираем все возможные связи
        for индекс, есть_связь in enumerate(строка_связей):
            сосед = индекс + 1
            
            # Если есть связь и сосед ещё не посещён
            if есть_связь == 1 and сосед not in посещённые:
                посещённые.append(сосед)
                уровни[сосед] = номер_волны + 1
                следующая_волна.append(сосед)
    
    текущая_волна = следующая_волна
    номер_волны += 1


уровни[стартовая_вершина] = 1

# Вывод результатов
print("Вершина | Уровень")
print("-" * 18)
for v in sorted(уровни):
    print(f"{v:^7} | {уровни[v]:^5}")
