Студенты = ['Корнилин', 'Клейменов', 'Млюкова', "Марьенко"]
Предметы = ['ТВиМС', 'Бухглалтерский учёт', 'Основы алгоритмизации']
Даты = ['07.03.2026', '05.04.2026', '25.02.2026']

Журнал = {}

for d in Даты:
    if d == '05.04.2026':
        for s in Предметы:
            if s == 'ТВиМС':
                for st in Студенты:
                    while True:
                        g = input(f"Оценка для {st} по {s} ({d}): ")
                        if g in ['2', '3', '4', '5']:
                            break
                        print("Введите 2, 3, 4 или 5")
                    Журнал[hash(d + s + st)] = g

print()
print(hash('05.04.2026' + 'ТВиМС' + 'Клейменов'))
print(Журнал[hash('05.04.2026' + 'ТВиМС' + 'Клейменов')])
